# Задача 1. На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток,которые нужно перевернуть, 
# чтобы все монетки были повернуты вверх одной и той же стороной.


# n = int(input("Введите кол-во монеток:  "))

# coins = [0, 1, 1, 0, 1]
# print(coins.count(0) if coins.count(0) < coins.count(1) else coins.count(1)) #тернарный оператор



# Задача 2. Требуется посчитать сумму целых чисел, расположенных между числами 1 и N включительно.

# n = int(input("введите число n:  "))
# list = [i for i in range(1, n+1)]    
# print(sum(list))

# Задача 3. Шеренга..

# n = int(input("Введите кол-во учеников:  "))
# height = int(input("Введите рост Пети в см:  "))


# Задача 4. Требуется найти наименьший натуральный делитель целого числа N, отличный от 1.

# n = int(input("введите число  "))
# i = 2
# while n%i != 0:
#     i += 1     
# print(i)





        